<?php

require_once('config.php');

$database = new PDO("sqlite:" . DBASEFILE);

if (!$database) {
    printf("DataBase error\n");
    exit;
}

function getCelsius($kelvin) {
    return round($kelvin - 273.15, 1);
}

function getMmHg($hpa) {
    return round($hpa / 1.33322, 0);
}

function windDirection($wind) {
    if ($wind > 348.75 || $wind <= 11.25) {
	return "Северный";
    } else if ($wind <= 33.75) {
	return "ССВ";
    } else if ($wind <= 56.25) {
	return "СВ";
    } else if ($wind <= 78.75) {
	return "ВСВ";
    } else if ($wind <= 101.25) {
	return "Восточный";
    } else if ($wind <= 123.75) {
	return "ВЮВ";
    } else if ($wind <= 146.25) {
	return "ЮВ";
    } else if ($wind <= 168.75) {
	return "ЮЮВ";
    } else if ($wind <= 191.25) {
	return "Южный";
    } else if ($wind <= 213.75) {
	return "ЮЮЗ";
    } else if ($wind <= 236.25) {
	return "ЮЗ";
    } else if ($wind <= 258.75) {
	return "ЗЮЗ";
    } else if ($wind <= 281.25) {
	return "Западный";
    } else if ($wind <= 303.75) {
	return "ЗСЗ";
    } else if ($wind <= 326.25) {
	return "СЗ";
    } else if ($wind <= 348.75) {
	return "ССЗ";
    }

    return "*";
}

function windDesc($speed) {
    if ($speed < 0.3) {
	return "штиль";
    } else if ($speed < 1.6) {
	return "тихий";
    } else if ($speed < 3.4) {
	return "легкий";
    } else if ($speed < 5.5) {
	return "слабый";
    } else if ($speed < 8.0) {
	return "умеренный";
    } else if ($speed < 10.8) {
	return "свежий";
    } else if ($speed < 13.9) {
	return "сильный";
    } else if ($speed < 17.2) {
	return "крепкий";
    } else if ($speed < 20.8) {
	return "очень крепкий";
    } else if ($speed < 24.5) {
	return "шторм";
    } else if ($speed < 28.5) {
	return "сильный шторм";
    } else if ($speed < 33) {
	return "жесткий шторм";
    } else {
	return "ураган";
    }
}

function cloudsDesc($cloud) {
    if ($cloud < 11) {
	return "Ясно";
    } else if ($cloud < 25) {
	return "Малооблачно";
    } else if ($cloud < 50) {
	return "Переменная облачность";
    } else if ($cloud < 80) {
	return "Облачно с прояснениями";
    } else {
	return "Пасмурно";
    }
}

$group = array(
    '200' => 'Слабый дождь с грозой',
    '201' => 'Дождь с грозой',
    '202' => 'Сильный дождь с грозой',
    '210' => 'Слабая гроза',
    '211' => 'Гроза',
    '212' => 'Сильная гроза',
    '221' => 'Местами гроза',
    '230' => 'Гроза, слабая морось',
    '231' => 'Гроза, морось',
    '232' => 'Гроза, сильная морось',

    '300' => 'Слабая морось',
    '301' => 'Морось',
    '302' => 'Сильная морось',
    '310' => 'Слабо моросящий дождь',
    '311' => 'Моросящий дождь',
    '312' => 'Сильная изморось',
    '313' => 'Ливень и изморось',
    '314' => 'Сильный ливень и изморось',
    '321' => 'Моросящий дождь',

    '500' => 'Слабый дождь',
    '501' => 'Умеренный дождь',
    '502' => 'Сильный дождь',
    '503' => 'Очень сильный дождь',
    '504' => 'Ливень',
    '511' => 'Холодный дождь',
    '520' => 'Слабый ливень',
    '521' => 'Ливень',
    '522' => 'Сильный ливень',
    '531' => 'Местами ливень',

    '600' => 'Слабый снег',
    '601' => 'Снег',
    '602' => 'Сильный снег',
    '611' => 'Дождь со снегом',
    '612' => 'Слабый дождь со снегом',
    '613' => 'Ливень со снегом',
    '615' => 'Слабый дождь и снег',
    '616' => 'Дождь и снег',
    '620' => 'Слабый снегопад',
    '621' => 'Снегопад',
    '622' => 'Сильный снегопад',

    '701' => 'Дымка',
    '711' => 'Дым',
    '721' => 'Туман',
    '731' => 'Песчанный/пылевой вихрь',
    '741' => 'Густой туман',
    '751' => 'Песок',
    '761' => 'Пыль',
    '762' => 'Вулканический пепел',
    '771' => 'Шквал',
    '781' => 'Торнадо',

    '800' => 'Ясное небо',

    '801' => 'Незначительная облачность',
    '802' => 'Разбросанная облачность',
    '803' => 'Значительная облачность',
    '804' => 'Сплошная облачность',

);

$days = array('воскресенье', 'понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота');
$months = array('января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря');

$query = "CREATE TABLE IF NOT EXISTS WeatherTable ".
	 "(id INTEGER PRIMARY KEY,".
	 " time INTEGER,".
	 " loc_id INTEGER,".
	 " sunrise INTEGER,".
	 " sunset INTEGER,".
	 " weather_id INTEGER,".
	 " weather_icon NVARCHAR,".
	 " temp REAL,".
	 " feels_like REAL,".
	 " temp_min REAL,".
	 " temp_max REAL,".
	 " pressure REAL,".
	 " humidity REAL,".
	 " wind_speed REAL,".
	 " wind_deg REAL,".
	 " visibility INTEGER,".
	 " clouds_all INTEGER)";
    $database->exec($query);

$sth = $database->prepare("SELECT * FROM WeatherTable ORDER BY id DESC LIMIT 1");
$sth->execute();
$row = $sth->fetch();

$day = date('j');
$mday = date('w');
$month = date('n') - 1;
$year = date('Y');

if ($row) {
    echo '<div class="weather">';
    echo '<div style="float: left;">
 <a href="https://openweathermap.org/city/1489425" target="_blank">
  <img src="https://openweathermap.org/img/wn/'.$row['weather_icon'].'@2x.png" alt="OpenWeather"/>
 </a>
</div>';
    echo '<div style="float: right;">';
    echo '<span class="w_title">Погода</span>
<span class="w_temp" id="w_temp">
'.getCelsius($row['temp']).' &#176;C</span><br/>
<span id="w_sign">'.$group[$row['weather_id']].'<br/>'.cloudsDesc($row['clouds_all']).'</span><br/>
<span id="w_wind">Ветер '.windDesc($row['wind_speed']).', '.round($row['wind_speed'], 1).' м/с '.windDirection($row['wind_deg']).'</span><br/>
<span id="w_press">
<svg viewBox="0 0 30 30" width="16px" style="vertical-align: text-bottom;" class="svg_button">
<path d="M7.69,13.2c0-0.99,0.19-1.94,0.58-2.85c0.39-0.91,0.91-1.68,1.57-2.33s1.44-1.17,2.34-1.56c0.9-0.39,1.85-0.58,2.84-0.58
	c0.99,0,1.94,0.19,2.85,0.58c0.9,0.39,1.68,0.91,2.33,1.56c0.65,0.65,1.17,1.43,1.56,2.33s0.58,1.85,0.58,2.85
	c0,1.62-0.48,3.06-1.44,4.34c-0.96,1.27-2.2,2.14-3.71,2.61v3.29h-4.24v-3.25c-1.54-0.45-2.81-1.32-3.79-2.61S7.69,14.83,7.69,13.2z
	 M9.3,13.2c0,1.55,0.56,2.88,1.69,3.99c1.11,1.12,2.45,1.68,4.02,1.68c1.03,0,1.99-0.25,2.86-0.76c0.88-0.51,1.57-1.2,2.09-2.07
	c0.51-0.87,0.77-1.82,0.77-2.85c0-0.77-0.15-1.5-0.45-2.21s-0.71-1.31-1.22-1.82c-0.51-0.51-1.12-0.92-1.83-1.22
	c-0.71-0.3-1.44-0.45-2.21-0.45c-0.77,0-1.5,0.15-2.21,0.45s-1.31,0.71-1.82,1.22c-0.51,0.51-0.92,1.12-1.22,1.82
	C9.45,11.7,9.3,12.43,9.3,13.2z M9.88,13.56v-0.72h2.17v0.72H9.88z M10.97,10.02l0.52-0.52l1.52,1.52l-0.52,0.53L10.97,10.02z
	 M13.5,14.95c0-0.42,0.15-0.78,0.44-1.09c0.29-0.31,0.65-0.47,1.06-0.48l2.73-4.49l0.66,0.35l-2.02,4.83
	c0.18,0.25,0.26,0.54,0.26,0.88c0,0.44-0.15,0.81-0.46,1.11c-0.31,0.3-0.68,0.45-1.12,0.45c-0.43,0-0.8-0.15-1.1-0.45
	C13.65,15.76,13.5,15.39,13.5,14.95z M14.81,10.28V8.12h0.69v2.17H14.81z M17.75,13.55v-0.74h2.17v0.74H17.75z"/>
</svg>'.getMmHg($row['pressure']).' ммрс</span>
<span id="w_humid">
<svg viewBox="0 0 30 30" width="16px" style="vertical-align: text-bottom;" class="svg_button">
<path d="M7.56,17.19c0-0.88,0.24-1.89,0.72-3.03s1.1-2.25,1.86-3.31c1.56-2.06,2.92-3.62,4.06-4.67l0.75-0.72
	c0.25,0.26,0.53,0.5,0.83,0.72c0.41,0.42,1.04,1.11,1.88,2.09s1.57,1.85,2.17,2.65c0.71,1.01,1.32,2.1,1.81,3.25
	s0.74,2.16,0.74,3.03c0,1-0.19,1.95-0.58,2.86c-0.39,0.91-0.91,1.7-1.57,2.36c-0.66,0.66-1.45,1.19-2.37,1.58
	c-0.92,0.39-1.89,0.59-2.91,0.59c-1,0-1.95-0.19-2.86-0.57c-0.91-0.38-1.7-0.89-2.36-1.55c-0.66-0.65-1.19-1.44-1.58-2.35
	S7.56,18.23,7.56,17.19z M9.82,14.26c0,0.83,0.17,1.49,0.52,1.99c0.35,0.49,0.88,0.74,1.59,0.74c0.72,0,1.25-0.25,1.61-0.74
	c0.35-0.49,0.53-1.15,0.54-1.99c-0.01-0.84-0.19-1.5-0.54-2c-0.35-0.49-0.89-0.74-1.61-0.74c-0.71,0-1.24,0.25-1.59,0.74
	C9.99,12.76,9.82,13.42,9.82,14.26z M11.39,14.26c0-0.15,0-0.27,0-0.35s0.01-0.19,0.02-0.33c0.01-0.14,0.02-0.25,0.05-0.32
	s0.05-0.16,0.09-0.24c0.04-0.08,0.09-0.15,0.15-0.18c0.07-0.04,0.14-0.06,0.23-0.06c0.14,0,0.25,0.04,0.33,0.12s0.14,0.21,0.17,0.38
	c0.03,0.18,0.05,0.32,0.06,0.45s0.01,0.3,0.01,0.52c0,0.23,0,0.4-0.01,0.52c-0.01,0.12-0.03,0.27-0.06,0.45
	c-0.03,0.17-0.09,0.3-0.17,0.38s-0.19,0.12-0.33,0.12c-0.09,0-0.16-0.02-0.23-0.06c-0.07-0.04-0.12-0.1-0.15-0.18
	c-0.04-0.08-0.07-0.17-0.09-0.24c-0.02-0.08-0.04-0.19-0.05-0.32c-0.01-0.14-0.02-0.25-0.02-0.32S11.39,14.41,11.39,14.26z
	 M11.98,22.01h1.32l4.99-10.74h-1.35L11.98,22.01z M16.28,19.02c0.01,0.84,0.2,1.5,0.55,2c0.35,0.49,0.89,0.74,1.6,0.74
	c0.72,0,1.25-0.25,1.6-0.74c0.35-0.49,0.52-1.16,0.53-2c-0.01-0.84-0.18-1.5-0.53-1.99c-0.35-0.49-0.88-0.74-1.6-0.74
	c-0.71,0-1.25,0.25-1.6,0.74C16.47,17.52,16.29,18.18,16.28,19.02z M17.85,19.02c0-0.23,0-0.4,0.01-0.52
	c0.01-0.12,0.03-0.27,0.06-0.45s0.09-0.3,0.17-0.38s0.19-0.12,0.33-0.12c0.09,0,0.17,0.02,0.24,0.06c0.07,0.04,0.12,0.1,0.16,0.19
	c0.04,0.09,0.07,0.17,0.1,0.24s0.04,0.18,0.05,0.32l0.01,0.32l0,0.34c0,0.16,0,0.28,0,0.35l-0.01,0.32l-0.05,0.32l-0.1,0.24
	l-0.16,0.19l-0.24,0.06c-0.14,0-0.25-0.04-0.33-0.12s-0.14-0.21-0.17-0.38c-0.03-0.18-0.05-0.33-0.06-0.45S17.85,19.25,17.85,19.02z
	"/>
</svg>'.round($row['humidity']).'&#37;</span><br/><br/>
<b id="curr_day">'.$days[$mday].'</b><br/>
<span id="curr_date">'.$day.' '.$months[$month].' '.$year.'</span>';
    echo '</div>';
    echo '</div>';
}

?>
